<?php

if ($text == '🌐 زیرمجموعه‌گیری') {
    $inviteLink = "https://ble.ir/Iranozv_bot?start=$from_id";
    $responseText = "🤖 ایران عضو - ربات جذب ممبر واقعی + کسب درآمد

📢 می‌خوای کانالتو تو بله پر از ممبر واقعی و فعال کنی؟  
👥 یا دنبال راهی برای کسب درآمد راحت از طریق عضویت تو کانال‌ها هستی؟  

✅ با ایران عضو هم می‌تونی برای کانالت عضو بگیری  
✅ هم با عضویت تو کانال‌ها، درآمد نقدی داشته باشی!

💸 به ازای هر عضویت، مستقیم پول بگیر  
🪙 سیستم زیرمجموعه‌گیری با پاداش 500 تومانی  
📲 همه چی خودکار و سریع انجام میشه  

📌 لینک ورود اختصاصی شما:
🔗 $inviteLink";
    sendMessage($from_id, $responseText);

    $inviteReward = 500;
    $responseText = "با ارسال بنر بالا به مخاطبین و دوستان خود، به‌ازای هر کاربری که *برای اولین بار* با لینک اختصاصی شما وارد ربات شود و ثبت‌نام کند، *{$inviteReward} تومان* هدیه دریافت خواهید کرد. 🎁

🆔 User ID: $from_id";
    sendMessage($from_id, $responseText, $userKeyboard);
    die;
}